{
  "entry": [
    {
      "id": "abcdefg",
      "submitter": "anon",
      "description": "K dot",
      "text": "<p>I once ran from the police</p>",
      "location": [
        -119.29655777409528,
        34.44136520185029
      ]
    },
    {
      "id": "abcdefh",
      "submitter": "anon",
      "location": [
        -100.29655777409528,
        34.44136520185029
      ],
      "description": "Murdering Beans",
      "text": "<p>When it came time to leave the nest and set out for college, I was the first. </p><p><br /></p><p>Sure, my sis could’ve ran away from home or something, but she didn’t, so I was my family’s first experience with departure. In our Neo-American picture perfect mixed race 2 child 2 cars one house 2 cats a dog family, we pretty much acted as a single family unit socially, holding the same interests and friends for years. Leaving was difficult. Remaining behind seemed just as difficult.</p><p><br /></p><p>We went to the dog pound sometime during my senior year of high school, with the intention of picking up a pupper that would be my emotional replacement. The expectation on the pupper from day 1 was to be like a salve on the gaping hole in the family left by my departure to college. High expectations for any being.</p><p><br /></p><p>As we walked through the aisles of barking, cowering, curious, smelly pups, someone, maybe mom, noticed a tag for a <strong>Bindee</strong>. That was the dog's given name, not a breed. Inside this cage was a meek, scared foxy little guy. Maybe a foot and a half long, big foxy ears pressed back against his head, skinny long haired daschund-like body, curled, bushy tail giving a cautious wag for his inquisitive visitors. Think the Mozilla Firefox except nervous and giving you the big puppy eyes, quiet, in the sea of caged, restless animals.</p><p><br /></p><p><img src=\"https://i.imgur.com/COqUsYv.jpg\" /></p><p><br /></p><p>We asked to “meet” him, as is the custom in such places. He gave off the impression of being a catch. He explored the room, met us 4 dutifully, like a good host, allowing himself to be pet and scratched. He was, by all accounts, chill. Just who we were looking for, because one can only replace chill with chill. Sera, for her part, donned him the moniker “Chill Beans”, an ism of mine during that time. </p><p><br /></p><p>It wasn’t until after we had signed the paperwork and begun packing him up that Mom mentioned what had caught her eye about this one. The name <strong>Bindee</strong>. What’s in a name? And what’s in one that’s just an arbitrary made up word assigned to him by the dog pound volunteers? You could separate that out if you chose, into two made up words, Bin Dee. And if you chose to know Vietnamese, like my mother, and translated that as, well, Binh đi, then you’d know that what’s in this name is that “Binh is going”. An apt statement for the moment, and our purpose there. </p><p><br /></p><p><img src=\"https://i.imgur.com/wdLxfvW.jpg\" /></p><p><br /></p><p>So there’s a tearing in the fabric of purpose that we are coexisting in this space, 9 years on. He’s much older, and the Firefox has become a grumpy defender of the household. I’m like the annoying visitor that sticks his face too close to his, squeezes him too tight, but bribes him with scraps and is able to open the front door, and so is permitted to remain. Still, the balance of the universe is askew, us being in the same place, when one’s purpose was to replace the other. There’s a cosmic redundancy here, one that can only be satisfied by a departure, just as it was opened and began. </p><p><br /></p><p>I almost killed him today. Death by peanut butter. He was being so good sitting patiently as some visitors came through. I had preemptively put him in his pen, because he’s had a rough track record with outsiders. And I guess I felt bad about it, so when they left, I decided to treat him to a spoon of peanut butter, like Sera does so much, and I had maybe twice before. I made a point of giving him breaks between big takes of it, letting him gulp down the remaining layers of PB off his tongue. When he was done, I washed the spoon and sat to ignore him again for an hour or so. But then he started retching. </p><p><br /></p><p>I was quite startled. Turning, I found him in an extended plank position, legs farther apart than shoulder width, leaning slightly forward, above the palms, a good transition position, but can also be held for a good deltoid and abdominal workout. I might have joined him if he wasn’t making sounds kinda like having lots of PB jammed in his throat. I immediately thought that he needed water, stat, because this guy was not gonna die right now, not like that this, and not by my hands. In typical Beans fashion, he declined to drink water, despite my placing it in front of him and gesturing frantically to the water. </p><p><br /></p><p><em>Dude you’re dying and I’m literally trying to help you</em>, thought I. </p><p><em>Dude you’re dying, please drink this</em>, said I. </p><p><br /></p><p>Instead, he just kinda maneuvered forward in that same position, like a straight-legged forward crab walk, very effective for working on the lower abdominal, forward towards the water, and perhaps his death place.</p><p><br /></p><p>Jesus Christ Beans, said I, giving little respect to the Catholic idols whose name I invoked in vain, but giving much respect to the thought that I was going to kill our old dog with a dollop of peanut butter to the throat. He seemed to be breathing fine through the nose, so I figured he wasn’t in danger of suffocating at the particular moment. My next thought was to boil some water, to wash the oils down his throat, or un-lodge the PB from wherever it was choking my sister’s dog. The next thought was that I couldn’t possibly convince this dog to drink hot water, and the image of me splashing hot water on his choking face was enough to make me giggle a little bit despite the fact that Beans was still choking to death while doing his best yogi plank impression. </p><p><br /></p><p>In all, the situation ended up resolving itself, like most things do, eventually, and we were able to delay the inevitable outcome of our cosmic imbalance for another time. I fear, however, that this struggle for singularity is reaching an apex point, and one of us shall meet their tragic end sooner than later, in a flurry of peanut butter goodness or road bike madness. </p><p><br /></p><p><img src=\"https://i.imgur.com/Db7HNs3.jpg\" /></p>"
    },
    {
      "text": "<p>yeah you do</p>",
      "description": "Jueanuea",
      "location": {
        "lng": -157.74337099999718,
        "lat": 60.02097728137264
      },
      "ttl": -1,
      "date": "",
      "submitter": "anon",
      "tags": [],
      "namespaceId": "public",
      "id": "A159oZp"
    }
  ],
  "entries": [
    {
      "_index": "n-public",
      "_type": "_doc",
      "_id": "abcdefg",
      "_score": 1,
      "_source": {
        "submitter": {
          "S": "anon"
        },
        "description": {
          "S": "K dot"
        },
        "location": [
          -119.29655777409528,
          34.44136520185029
        ],
        "tags": {
          "L": []
        }
      }
    },
    {
      "_index": "n-public",
      "_type": "_doc",
      "_id": "abcdefc",
      "_score": 1,
      "_source": {
        "submitter": {
          "S": "anon"
        },
        "description": {
          "S": "B dot"
        },
        "location": [
          -93.29655777409528,
          29.44136520185029
        ],
        "tags": {
          "L": []
        }
      }
    },
    {
      "_index": "n-public",
      "_type": "_doc",
      "_id": "abcdefh",
      "_score": 1,
      "_source": {
        "submitter": {
          "S": "anon"
        },
        "description": {
          "S": "A dot"
        },
        "location": [
          -100.29655777409528,
          34.44136520185029
        ],
        "tags": {
          "L": []
        }
      }
    }
  ]
}
